Repository: mihaicris/Digi-Cloud
Catalog: Digi Cloud/*.lproj/Localizable.strings
Languages: ro

source: %d days ago
ro: acum %d zile

source: %d files
ro: %d fișiere

source: %d folders
ro: %d directoare

source: %d hour ago
ro: acum %d oră

source: %d hours ago
ro: acum %d ore

source: %d minute ago
ro: acum %d minut

source: %d minutes ago
ro: acum %d minute

source: %d months ago
ro: acum %d luni

source: %d weeks ago
ro: acum %d săptămâni

source: %d years ago
ro: acum %d ani

source: 1 Month
ro: 1 lună

source: 1 day
ro: 1 zi

source: 1 file
ro: 1 fișier

source: 1 folder
ro: 1 director

source: 1 hour
ro: 1 oră

source: Accounts
ro: Conturi

source: Add Account
ro: Adăugați un cont

source: Add member
ro: Adăugați un membru

source: An error has occured while processing the request.
ro: A avut loc o eroare la procesarea cererii.

source: An error has occured, please try again later.
ro: A avut loc o eroare, încercați mai târziu.

source: An error has occured. Some elements already exists at the destination or the destination location no longer exists.
ro: A avut loc o eroare. Elemente există deja la destinație sau locația destinație nu mai este disponibilă.

source: An error has occured. Some elements no longer exists.
ro: A avut loc o eroare. Fișierele nu mai există.

source: An error has occurred. Please try again later!
ro: A avut loc o eroare. Încearcă mai târziu!

source: Are you sure you want to delete %d items?
ro: Sigur se șterg %d fișiere?

source: Are you sure you want to delete this file?
ro: Sigur se șterge acest fișier?

source: Are you sure you want to delete this folder?
ro: Sigur se șterge acest director?

source: Are you sure you want to remove these accounts?
ro: Sigur se șterg aceste conturi?

source: Are you sure you want to remove these bookmarks?
ro: Sigur se elimină din favorite?

source: Are you sure you want to remove this account?
ro: Sigur se elimină acest cont?

source: Are you sure you want to remove this bookmark?
ro: Sigur se elimină din favorite?

source: Auto Password Links
ro: Parole automate pentru linkuri

source: Back
ro: Înapoi

source: Bookmarks
ro: Favorite

source: Can create download links
ro: Poate crea link de descărcare

source: Can create receive links
ro: Poate crea link de primire

source: Can manage share
ro: Poate administra partajarea

source: Can modify
ro: Poate modifica

source: Cancel
ro: Renunțați

source: Change
ro: Schimbați

source: Change to Title Case
ro: Schimbați în stil titlu

source: Change to UPPER CASE
ro: Schimbați în litere mari

source: Change to lower case
ro: Schimbați în litere mici

source: Change to sentence
ro: Schimbați în stil propoziție

source: Characters \ / : ? < > " | are not allowed.
ro: Caracterele \ / : ? < > " | nu sunt permise.

source: Choose a destination
ro: Alegeți o destinație

source: Clear Cache
ro: Ștergeți fișierele temporare

source: Confirm
ro: Confirmați

source: Confirm Deletion
ro: Confirmare ștergere

source: Connections
ro: Conexiuni

source: Copy
ro: Copiați

source: Could not add new member.
ro: Nu s-a putut adauga membrul.

source: Could not update member permissions.
ro: Nu s-au putut actualiza permisiunile membrului.

source: Create
ro: Creați

source: Create Folder
ro: Creați un director

source: Custom
ro: Personalizat

source: Data
ro: Date

source: Delete
ro: Ștergeți

source: Delete (%d)
ro: Ștergeți (%d)

source: Delete All
ro: Ștergeți tot

source: Delete Folder
ro: Ștergeți directorul

source: Delete Link
ro: Ștergeți linkul

source: Deleting Link
ro: Se șterge linkul

source: Device is offline.
ro: Echipamentul este offline.

source: Digi Storage file share
ro: Partajare link

source: Done
ro: Gata

source: Download Links
ro: Linkuri de descărcare

source: EMAIL ADDRESS
ro: ADRESĂ EMAIL

source: EXTENDED
ro: PERMISIUNI EXTINSE

source: Edit
ro: Editați

source: Email address
ro: Adresă email

source: Email on receiving files
ro: Email la primire fișiere

source: Error
ro: Eroare

source: Error accessing files on device.
ro: Eroare la accesarea fișierelor.

source: Error deleting account from Keychain
ro: Eroare la ștergerea contului din Keychain.

source: Error fetching accounts from Keychain
ro: Eroare la citirea conturilor din Keychain.

source: Error on fetching bookmarks
ro: Eroare la obținerea favoritelor

source: Error reading account from Keychain
ro: Eroare la citirea contului din Keychain.

source: Error saving account to Keychain
ro: Eroare la salvarea contului în Keychain.

source: Everywhere
ro: Peste tot

source: File is no longer available. Folder will refresh.
ro: Fișierul nu mai este disponibil. Conținutul directorului se va actualiza.

source: First Name
ro: Prenume

source: Folder Name
ro: Nume director

source: Folder already exists. Please choose a different name.
ro: Directorul există deja. Alege un alt nume.

source: Folder content
ro: Conținut director

source: Folder information
ro: Informații director

source: Folder is Empty
ro: Directorul este gol

source: Folders first
ro: Directoare la început

source: Forever
ro: Niciodată

source: Forgot password?
ro: Ați uitat parola?

source: Hello!
ro: Salut!

source: I am sending you a download link:
ro: Îți trimit un link de descărcare:

source: I am sending you an upload link:
ro: Îți trimit un link de primire:

source: Information
ro: Informații

source: LOCATION
ro: LOCAȚIE

source: LOGIN
ro: AUTENTIFICARE

source: Last Name
ro: Nume

source: Link has no expiration date
ro: Nu expiră niciodată

source: Links Password
ro: Parole linkuri

source: Loading ...
ro: Se încarcă ...

source: Locations
ro: Locații

source: Log in to Another Account
ro: Autentificați-vă în alt cont

source: MEMBERS
ro: MEMBRII

source: Main storage
ro: Locație principală

source: Make available offline
ro: Salvat permanent

source: Make picture
ro: Folosiți camera

source: Manage Accounts
ro: Gestionați conturile

source: Manage Share
ro: Administrați partajarea

source: Members
ro: Membrii

source: Mobile Data
ro: Transfer prin date mobile

source: More actions
ro: Mai multe acțiuni

source: Move
ro: Mutați

source: Name
ro: Nume

source: Name is the same.
ro: Numele este același.

source: No Preview Available
ro: Vizualizarea nu este disponibilă.

source: No accounts
ro: Niciun cont salvat

source: No bookmarks
ro: Nu aveți locații favorite

source: Note: Including subfolders
ro: Notă: Inclusiv subdirectoare

source: OK
ro: Am înțeles

source: OWNER
ro: PROPRIETAR

source: Owner
ro: Proprietar

source: PASSWORD
ro: PAROLĂ

source: PERMISSIONS
ro: PERMISIUNI

source: Password is:
ro: Parola este:

source: Please contact RCS RDS for password information.
ro: Te rugăm să contactezi compania RCS RDS pentru informații despre parolă.

source: Please fill in the fields.
ro: Te rugăm să completezi toate câmpurile.

source: Please provide the credentials for your Digi Storage account.
ro: Te rugăm să furnizezi datele de autentificare pentru contul tău Digi Storage.

source: Please provide the email address of the Digi Storage user.
ro: Precizați adresa de email a utilizatorului Digi Storage.

source: Please wait...
ro: Se așteaptă ...

source: Preparing Link
ro: Se pregătește link-ul

source: Profile picture
ro: Poză de profil

source: READ
ro: DOAR CITIRE

source: Receive Files
ro: Trimiteți link de primire

source: Receive Links
ro: Linkuri de primire

source: Remove Bookmark
ro: Eliminați din favorite

source: Remove Share
ro: Ștergeți partajarea

source: Removing share...
ro: Se șterge partajarea ...

source: Rename
ro: Redenumiți

source: Rename File
ro: Redenumire fișier

source: Rename Folder
ro: Redenumire director

source: Rename utilities:
ro: Utilitare redenumire:

source: Replace points with spaces
ro: Înlocuire puncte cu spații

source: Replace spaces with points
ro: Înlocuire spații cu puncte

source: Replace spaces with underscores
ro: Înlocuire spații cu linii subliniere

source: Replace underscores with spaces
ro: Înlocuire linii subliniere cu spații

source: SHARED
ro: PARTAJAT

source: Save
ro: Salvați

source: Save copy
ro: Salvați o copie

source: Search for files or folders
ro: Căutați fișiere sau directoare

source: Security
ro: Securitate

source: See Share Members
ro: Vedeți membrii partajării

source: Seen %d time
ro: Accesat %d dată

source: Seen %d times
ro: Accesat de %d ori

source: Select Mode
ro: Mod selecție

source: Select picture
ro: Selectați o poză

source: Send Link
ro: Trimiteți link

source: Server replied with Status Code:
ro: Serverul a răspuns cu codul de stare:

source: Set Bookmark
ro: Salvați la favorite

source: Settings
ro: Setări

source: Share
ro: Partajați

source: Shared by you
ro: Partajat de tine

source: Shared with you
ro: Partajat cu tine

source: Size
ro: Mărime

source: Sorry, this short URL is not available.
ro: Din păcate acest link nu este disponibil.

source: Sort by Date
ro: Sortați după dată

source: Sort by Name
ro: Sortați după nume

source: Sort by Size
ro: Sortați după mărime

source: Sort by Type
ro: Sortați după tip

source: Sort folder
ro: Sortați directorul

source: Switch Account
ro: Schimbați contul

source: The app will now close
ro: Aplicația se va închide.

source: The internet appears to be offline.
ro: Internetul nu pare să fie accesibil.

source: The link is public
ro: Link-ul este public

source: The location is not available.
ro: Locația nu este disponibilă.

source: The request timed out.
ro: Solicitarea a expirat.

source: There was an error at requesting share information.
ro: Eroare la primirea informațiilor despre partajare.

source: There was an error at saving the file. Try again later or reinstall the app.
ro: A avut loc o eroare la salvarea fișierului. Încearcă mai târziu sau reinstalați aplicația.

source: There was an error at share creation.
ro: Eroare la crearea partajării.

source: There was an error communicating with the network.
ro: A avut loc o eroare la comunicarea cu rețeaua.

source: There was an error creating the folder.
ro: A avut loc o eroare la crearea directorului.

source: There was an error while calculating the folder size.
ro: A avut loc o eroare la calcularea mărimii directorului.

source: There was an error while refreshing the locations.
ro: A avut loc o eroare la actualizarea locațiilor.

source: There was an error while removing the share.
ro: A avut loc o eroare la ștergerea partajării.

source: There was an error while saving the user name.
ro: A avut loc o eroare la salvarea utilizatorului.

source: There was an error, please try again later.
ro: A avut loc o eroare, încearcă mai târziu.

source: This action is not reversible.
ro: Această acțiune nu este reversibilă.

source: This file type can't be viewed.
ro: Acest tip de fișier nu poate fi vizualizat.

source: This folder
ro: Acest director

source: This name already exists. Please choose a different one.
ro: Numele există deja. Alegeți unul diferit.

source: Uploaded %d time
ro: Accesat %d dată

source: Uploaded %d times
ro: Accesat de %d ori

source: Usage
ro: Utilizare

source: User
ro: Utilizator

source: User details
ro: Detalii utilizator

source: VALIDITY
ro: VALABILITATE

source: Version
ro: Versiune

source: Would you like to use cellular data?
ro: Doriți să folosiți date celulare?

source: Yes
ro: Da

source: Your session has expired, please log in again.
ro: Sesiunea a expirat, vă rugăm să vă reautentificați.

source: for
ro: pentru

source: last month
ro: luna trecută

source: last week
ro: săptămâna trecută

source: last year
ro: anul trecut

source: now
ro: acum

source: yesterday
ro: ieri
